H4W9/ESP32_FlipSocial/ESP32_FlipSocial.ino
// Offline cache (SD /fs_cache)
// Feed / comments / messages / profile responses are cached to SD so they can be
// shown when WiFi is down. Sets g_usingCache when the on-screen data is from cache.
static String cacheName(const char *prefix, const String &key) {
  String s = "/fs_cache/"; s += prefix;
  for (size_t i = 0; i < key.length(); i++) {
    char c = key[i];
    bool ok = (c >= '0' && c <= '9') || (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z');
    s += ok ? c : '_';
  }
  s += ".json";
  return s;
}
static void cacheWrite(const String &path, const String &content) {
  if (!SD.exists("/fs_cache")) SD.mkdir("/fs_cache");
  File f = SD.open(path, FILE_WRITE);
  if (!f) return;
  f.print(content);
  f.close();
}
static String cacheRead(const String &path) {
  File f = SD.open(path, FILE_READ);
  if (!f) return "";
  String s = f.readString();
  f.close();
  return s;
}
// GET with caching: on a valid response (contains `marker`) refresh the cache and
// return it; otherwise (offline / failed) fall back to the last cached copy.
static String fsGetCached(const String &url, const String &cachePath, const char *marker) {
  String resp;
  if (WiFi.status() == WL_CONNECTED) resp = fsRequest("GET", url);
  if (resp.indexOf(marker) >= 0) { cacheWrite(cachePath, resp); g_usingCache = false; return resp; }
  g_usingCache = true;
  return cacheRead(cachePath);
}

static bool fsBool(JsonVariant v) {
  if (v.is<bool>()) return v.as<bool>();
  String s = v.as<String>();
  return s == "true" || s == "True" || s == "1";
}

static int fsLoadFeed(FSMsg *arr, int series) {
  String url = "https://www.jblanked.com/flipper/api/feed/20/" + fsUser() + "/" + String(series) + "/max/series/";
  String resp = fsGetCached(url, cacheName("feed_", fsUser() + "_" + series), "\"feed\"");
  JsonDocument doc;
  if (deserializeJson(doc, resp)) return 0;
  JsonArray f = doc["feed"].as<JsonArray>();
  if (f.isNull()) return 0;
  int n = 0;
  for (JsonVariant it : f) {
    if (n >= FS_MAX) break;
    FSMsg &m = arr[n++];
    m.id = it["id"].as<uint32_t>();
    m.user = it["username"].as<String>();
    m.msg = it["message"].as<String>();
    m.date = it["date_created"].as<String>();
    m.flips = it["flip_count"].as<int>();
    m.comments = it["comment_count"].as<int>();
    m.flipped = fsBool(it["flipped"]);
  }
  return n;
}

static int fsLoadComments(FSMsg *arr, uint32_t postId) {
  String url = "https://www.jblanked.com/flipper/api/feed/comments/20/" + fsUser() + "/" + String(postId) + "/";
  String resp = fsGetCached(url, cacheName("cmt_", String(postId)), "\"comments\"");
  JsonDocument doc;
  if (deserializeJson(doc, resp)) return 0;
  JsonArray f = doc["comments"].as<JsonArray>();
  if (f.isNull()) return 0;
  int n = 0;
  for (JsonVariant it : f) {
    if (n >= FS_MAX) break;
    FSMsg &m = arr[n++];
    m.id = it["id"].as<uint32_t>();
    m.user = it["username"].as<String>();
    m.msg = it["message"].as<String>();
    m.date = it["date_created"].as<String>();
    m.flips = it["flip_count"].as<int>();
    m.comments = 0;
    m.flipped = fsBool(it["flipped"]);
  }
  return n;
}

// Guard for actions that POST (need a live connection). Shows an offline message.
static bool fsOnline() {
  if (WiFi.status() != WL_CONNECTED) {
    msgScreen("Offline", "Connect to WiFi first", "Settings > WiFi Setup", TFT_RED);
    return false;
  }
  return true;
}

// Every write endpoint answers "[SUCCESS]..." on success (same token the
// FlipSocial app matches on); anything else is a failure worth reporting.
static bool fsOk(const String &r) { return r.indexOf("[SUCCESS]") != -1; }

// Extract a short human-readable reason from a failed API response (like the app).
static String fsReason(const String &resp) {
  if (resp.length() == 0) return "No response from server";
  JsonDocument d;
  if (!deserializeJson(d, resp)) {
    const char *keys[] = { "error", "message", "detail", "reason" };
    // ArduinoJson 7: as<String>() on a missing key yields the literal "null",
    // so skip absent keys explicitly rather than testing the string length.
    for (const char *k : keys) {
      if (d[k].isNull()) continue;
      String s = d[k].as<String>();
      if (s.length()) return s;
    }
  }
  String s = resp; s.trim();
  if (s.startsWith("[")) { int e = s.indexOf(']'); if (e >= 0) { s = s.substring(e + 1); s.trim(); } }
  if (s.length() > 96) s = s.substring(0, 96);
  return s.length() ? s : String("Unknown error");
}

// Reason from the last failed write, so helpers that only return bool can still
// tell the caller's dialog what the server actually said.
static String g_fsErr;
static bool fsOkOr(const String &r) {
  if (fsOk(r)) { g_fsErr = ""; return true; }
  g_fsErr = fsReason(r);
  return false;
}

static int g_commentsAdded = 0;   // # comments added in the current comments view

// The request is synchronous, so only move the local flip state once the server
// has confirmed it — otherwise a rejected flip still reads as applied until the
// next reload.
static void fsFlip(FSMsg &m) {
  if (!fsOnline()) return;
  String payload = String("{\"username\":\"") + jsonEsc(fsUser()) + "\",\"post_id\":\"" + m.id + "\"}";
  String r = fsRequest("POST", "https://www.jblanked.com/flipper/api/feed/flip/", payload);
  if (!fsOk(r)) { ledErr(); msgScreen("Flip", "Failed", fsReason(r), TFT_RED); ledOff(); return; }
  ledBlinkOk();
  m.flipped = !m.flipped;
  m.flips += m.flipped ? 1 : -1;
  if (m.flips < 0) m.flips = 0;
}

// Credential check. The profile endpoint needs no auth, so a wrong password
// still renders a perfectly good profile and only shows up later when a post
// fails. POST /user/login/ is the API's own verification; the response strings
// below are the ones the FlipSocial app matches on. (FSCred is declared at the
// top of the file so Arduino's auto-generated prototypes can see it.)
static FSCred fsCheckCreds() {
  String u = credGet("user"), p = credGet("pass");
  if (!u.length() || !p.length()) return FSC_EMPTY;
  String payload = String("{\"username\":\"") + jsonEsc(u) + "\",\"password\":\"" + jsonEsc(p) + "\"}";
  String r = fsRequest("POST", "https://www.jblanked.com/flipper/api/user/login/", payload, false);
  if (r.indexOf("[SUCCESS]") >= 0)                     return FSC_OK;
  if (r.indexOf("User not found") >= 0)                return FSC_NOUSER;
  if (r.indexOf("Incorrect password") >= 0)            return FSC_BADPASS;
  if (r.indexOf("Username or password is empty.") >= 0) return FSC_EMPTY;
  return FSC_ERR;
}
static const char *fsCredText(FSCred c) {
  switch (c) {
    case FSC_OK:      return "Credentials verified";
    case FSC_NOUSER:  return "User not found - check Settings";
    case FSC_BADPASS: return "Incorrect password";
    case FSC_EMPTY:   return "Username / password not set";
    default:          return "Could not verify credentials";
  }
}

// Profile / friends API (jblanked user endpoints)
// GET /user/profile/{user}/ -> {"bio","friends_count","date_created"}
static FSProfile fsLoadProfile(const String &who) {
  FSProfile p; p.ok = false; p.friends = 0;
  String url = "https://www.jblanked.com/flipper/api/user/profile/" + who + "/";
  String resp = fsGetCached(url, cacheName("prof_", who), "\"friends_count\"");
  JsonDocument doc;
  if (deserializeJson(doc, resp)) return p;
  if (doc["bio"].isNull() && doc["friends_count"].isNull()) return p;
  p.bio     = doc["bio"].as<String>();
  p.friends = doc["friends_count"].as<int>();
  p.joined  = doc["date_created"].as<String>();
  p.ok      = true;
  return p;
}
static bool fsChangeBio(const String &bio) {
  String payload = String("{\"username\":\"") + jsonEsc(fsUser()) + "\",\"bio\":\"" + jsonEsc(bio) + "\"}";
  String r = fsRequest("POST", "https://www.jblanked.com/flipper/api/user/change-bio/", payload);
  return fsOkOr(r);
}
// GET /user/friends/{user}/{max}/ -> {"friends":[username, ...]}
static int fsLoadFriends(String *arr, int maxN) {
  String url = "https://www.jblanked.com/flipper/api/user/friends/" + fsUser() + "/" + String(maxN) + "/";
  String resp = fsGetCached(url, cacheName("frnd_", fsUser()), "\"friends\"");
  JsonDocument doc;
  if (deserializeJson(doc, resp)) return 0;
  JsonArray f = doc["friends"].as<JsonArray>();
  if (f.isNull()) return 0;
  int n = 0;
  for (JsonVariant v : f) { if (n >= maxN) break; arr[n++] = v.as<String>(); }
  return n;
}
static bool fsAddFriend(const String &friendName) {
  String payload = String("{\"username\":\"") + jsonEsc(fsUser()) + "\",\"friend\":\"" + jsonEsc(friendName) + "\"}";
  String r = fsRequest("POST", "https://www.jblanked.com/flipper/api/user/add-friend/", payload);
  return fsOkOr(r);
}
static bool fsRemoveFriend(const String &friendName) {
  if (!fsOnline()) return false;
  String payload = String("{\"username\":\"") + jsonEsc(fsUser()) + "\",\"friend\":\"" + jsonEsc(friendName) + "\"}";
  String r = fsRequest("POST", "https://www.jblanked.com/flipper/api/user/remove-friend/", payload);
  return fsOkOr(r);
}

// Messages API (jblanked messages endpoints)
// GET /messages/{me}/get/list/{max}/ -> {"users":[username, ...]} (conversations)
static int fsLoadMsgUsers(String *arr, int maxN) {
  String url = "https://www.jblanked.com/flipper/api/messages/" + fsUser() + "/get/list/" + String(maxN) + "/";
  String resp = fsGetCached(url, cacheName("msglist_", fsUser()), "\"users\"");
  JsonDocument doc;
  if (deserializeJson(doc, resp)) return 0;
  JsonArray u = doc["users"].as<JsonArray>();
  if (u.isNull()) return 0;
  int n = 0;
  for (JsonVariant v : u) { if (n >= maxN) break; arr[n++] = v.as<String>(); }
  return n;
}
// GET /messages/{me}/get/{peer}/{max}/ -> {"conversations":[{"sender","content","date_created"}]}
static int fsLoadMessages(FSMsg *arr, const String &peer) {
  String url = "https://www.jblanked.com/flipper/api/messages/" + fsUser() + "/get/" + peer + "/40/";
  String resp = fsGetCached(url, cacheName("msg_", peer), "\"conversations\"");
  JsonDocument doc;
  if (deserializeJson(doc, resp)) return 0;
  JsonArray c = doc["conversations"].as<JsonArray>();
  if (c.isNull()) return 0;
  int n = 0;
  for (JsonVariant it : c) {
    if (n >= FS_MAX) break;
    FSMsg &m = arr[n++];
    m.user = it["sender"].as<String>();
    m.msg  = it["content"].as<String>();
    m.date = it["date_created"].as<String>();
    m.id = 0; m.flips = 0; m.comments = 0; m.flipped = false;
  }
  return n;
}
// POST /messages/{me}/post/  body {"receiver","content"}
static bool fsSendMessage(const String &peer, const String &content) {
  if (!fsOnline()) return false;
  String payload = String("{\"receiver\":\"") + jsonEsc(peer) + "\",\"content\":\"" + jsonEsc(content) + "\"}";
  String r = fsRequest("POST", "https://www.jblanked.com/flipper/api/messages/" + fsUser() + "/post/", payload);
  bool ok = fsOk(r);
  if (!ok) { ledErr(); msgScreen("Message", "Failed", fsReason(r), TFT_RED); ledOff(); }
  else ledBlinkOk();
  return ok;
}

// GET /user/explore/{keyword}/{max}/ -> {"users":[username, ...]}
static int fsExplore(const String &keyword, String *arr, int maxN) {
  String url = "https://www.jblanked.com/flipper/api/user/explore/" + keyword + "/" + String(maxN) + "/";
  String resp = fsRequest("GET", url);
  JsonDocument doc;
  if (deserializeJson(doc, resp)) return 0;
  JsonArray u = doc["users"].as<JsonArray>();
  if (u.isNull()) return 0;
  int n = 0;
  for (JsonVariant v : u) { if (n >= maxN) break; arr[n++] = v.as<String>(); }
  return n;
}

