H4W9/ESP32_FlipSocial/ESP32_FlipSocial.ino
// Returns true if a comment was successfully added.
static bool fsAddComment(uint32_t postId) {
  if (!fsOnline()) return false;
  char b[FS_MAX_MESSAGE + 1] = {0};
  if (!touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "Comment:", false)) return false;
  if (strlen(b) == 0) return false;
  String payload = String("{\"username\":\"") + jsonEsc(fsUser()) + "\",\"content\":\"" + jsonEsc(b) + "\",\"post_id\":\"" + postId + "\"}";
  String r = fsRequest("POST", "https://www.jblanked.com/flipper/api/feed/comment/", payload);
  bool ok = fsOk(r);
  if (!ok) { ledErr(); msgScreen("Comment", "Failed", fsReason(r), TFT_RED); ledOff(); }
  else ledBlinkOk();
  return ok;
}

static void fsPost() {
  if (!fsOnline()) return;
  char b[FS_MAX_MESSAGE + 1] = {0};
  if (!touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "New Post:", false)) return;
  if (strlen(b) == 0) return;
  tft->fillScreen(COL_BG); drawHeader("New Post", true); statusLine("Posting...");
  String payload = String("{\"username\":\"") + jsonEsc(fsUser()) + "\",\"content\":\"" + jsonEsc(b) + "\"}";
  String r = fsRequest("POST", "https://www.jblanked.com/flipper/api/feed/post/", payload);
  bool ok = fsOk(r);
  if (ok) ledOk(); else ledErr();
  msgScreen("New Post", ok ? "Posted!" : "Failed", ok ? String("") : fsReason(r), ok ? COL_OK : TFT_RED);
  ledOff();
}

// Word-wrap `s` to `maxW` pixels (font 2). If `out` is non-null, fills lines;
// returns the line count.
static int fsWrap(const String &s, int maxW, String *out, int maxLines) {
  int count = 0;
  String line = "";
  auto flush = [&]() { if (out && count < maxLines) out[count] = line; count++; line = ""; };
  int i = 0, n = s.length();
  while (i < n) {
    if (s[i] == '\n') { flush(); i++; continue; }
    int j = i;
    while (j < n && s[j] != ' ' && s[j] != '\n') j++;
    String word = s.substring(i, j);
    String cand = line.length() ? line + " " + word : word;
    if (tft->textWidth(cand.c_str(), 2) <= maxW) {
      line = cand;
    } else {
      if (line.length()) flush();
      line = word;
      while (tft->textWidth(line.c_str(), 2) > maxW && line.length() > 1) {
        int k = line.length();
        while (k > 1 && tft->textWidth(line.substring(0, k).c_str(), 2) > maxW) k--;
        String part = line.substring(0, k);
        line = line.substring(k);
        String keep = line; line = part; flush(); line = keep;
      }
    }
    i = j;
    while (i < n && s[i] == ' ') i++;
  }
  if (line.length() || count == 0) flush();
  return count;
}

// Black or white, whichever is legible on the given RGB565 background.
static uint16_t contrastText(uint16_t c) {
  int r = ((c >> 11) & 0x1F) * 255 / 31;
  int g = ((c >> 5) & 0x3F) * 255 / 63;
  int b = (c & 0x1F) * 255 / 31;
  return ((r * 299 + g * 587 + b * 114) / 1000) > 140 ? 0x0000 : 0xFFFF;
}

static int fsBubbleH(const FSMsg &m, int mode) {
  int nl = fsWrap(m.msg, SCRW - 2 * FS_BM - 2 * FS_BP, nullptr, 0);
  if (nl < 1) nl = 1;
  // Messages: sender line + body only. Feed/comments: + a flips/counts footer line.
  if (mode == FS_MESSAGES) return FS_BP + FS_LH + nl * FS_LH + FS_BP;
  return FS_BP + FS_LH + nl * FS_LH + 6 + FS_LH + FS_BP;
}

// Draw one bubble at content-space top `yTop` into the viewer sprite.
static void fsDrawBubble(TFT_eSprite &g, const FSMsg &m, int yTop, int idx, int mode) {
  int bx = FS_BM, bw = SCRW - 2 * FS_BM;
  String lines[24];
  int nl = fsWrap(m.msg, bw - 2 * FS_BP, lines, 24);
  if (nl < 1) nl = 1;
  int bh = fsBubbleH(m, mode);

  if (mode == FS_MESSAGES) {
    bool own = (m.user == fsUser());
    uint16_t fill = own ? COL_SEL : COL_ACCENT;
    uint16_t body = own ? contrastText(fill) : COL_FG;   // legible on the own-message fill
    g.fillRoundRect(bx, yTop, bw, bh, 8, fill);
    g.drawRoundRect(bx, yTop, bw, bh, 8, theme.neon(idx * 2, own ? COL_SEL : COL_DIM));
    int tx = bx + FS_BP, ty = yTop + FS_BP;
    g.setTextDatum(TL_DATUM);
    g.setTextColor(body, fill);
    g.drawString(own ? String("You") : m.user, tx, ty, 2);
    ty += FS_LH;
    g.setTextColor(body, fill);
    for (int i = 0; i < nl; i++) { g.drawString(lines[i], tx, ty, 2); ty += FS_LH; }
    return;
  }

  bool showComments = (mode == FS_FEED || mode == FS_MYPOSTS);
  uint16_t fill = COL_ACCENT;
  g.fillRoundRect(bx, yTop, bw, bh, 8, fill);
  g.drawRoundRect(bx, yTop, bw, bh, 8, theme.neon(idx * 2, m.flipped ? COL_SEL : COL_DIM));
  int tx = bx + FS_BP, ty = yTop + FS_BP;
  g.setTextDatum(TL_DATUM);
  g.setTextColor(COL_FG, fill);
  g.drawString(m.user, tx, ty, 2);
  g.setTextDatum(TR_DATUM);
  g.setTextColor(COL_DIM, fill);
  g.drawString(m.date, bx + bw - FS_BP, ty, 2);
  g.setTextDatum(TL_DATUM);
  ty += FS_LH;
  g.setTextColor(COL_FG, fill);
  for (int i = 0; i < nl; i++) { g.drawString(lines[i], tx, ty, 2); ty += FS_LH; }
  ty += 6;
  g.setTextColor(COL_FG, fill);
  g.drawString((m.flipped ? String("* ") : String("")) + m.flips + (m.flips == 1 ? " Flip" : " Flips"), tx, ty, 2);
  if (showComments) {
    g.setTextDatum(TR_DATUM);
    g.drawString(String(m.comments) + (m.comments == 1 ? " Comment" : " Comments"), bx + bw - FS_BP, ty, 2);
    g.setTextDatum(TL_DATUM);
  }
}

// forward decls (mutually recursive: feed action popup opens the comments viewer)
static FSVResult fsViewer(FSMsg *arr, int n, const String &title, int mode, uint32_t ctxPost, int series);
static int fsCommentsScreen(uint32_t postId);   // returns # comments added

static void fsActionPopup(FSMsg &m) {
  // Cap the width to the panel — the 264 px design overflows the V8's 240 px.
  int bw = min(264, SCRW - 24), bh = 252, bx = (SCRW - bw) / 2, by = (SCRH - bh) / 2;
  int byy = by + 44, bhh = 44, gap = 8;
  for (;;) {
    const char *labels[4] = { m.flipped ? "Unflip" : "Flip", "View Comments", "Comment", "Close" };
    tft->fillRoundRect(bx, by, bw, bh, 10, COL_ACCENT);
    tft->drawRoundRect(bx, by, bw, bh, 10, theme.neon(2, COL_SEL));
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
    tft->drawString(m.user, bx + bw / 2, by + 22, 2);
    for (int i = 0; i < 4; i++) {
      int yy = byy + i * (bhh + gap);
      uint16_t f = (i == 0 && m.flipped) ? COL_SEL : COL_BG;
      tft->fillRoundRect(bx + 16, yy, bw - 32, bhh, 6, f);
      tft->drawRoundRect(bx + 16, yy, bw - 32, bhh, 6, theme.neon(i, COL_DIM));
      tft->setTextColor(COL_FG, f);
      tft->drawString(labels[i], bx + bw / 2, yy + bhh / 2, 2);
    }
    tft->setTextDatum(TL_DATUM);

    uint16_t tx, ty;
    if (!waitTap(tx, ty)) continue;
    if ((int)tx < bx || (int)tx > bx + bw || (int)ty < by || (int)ty > by + bh) return;  // outside = close
    int i = ((int)ty - byy) / (bhh + gap);
    if (i < 0 || i > 3 || (((int)ty - byy) % (bhh + gap)) > bhh) continue;
    if (i == 0) { fsFlip(m); return; }
    if (i == 1) { m.comments += fsCommentsScreen(m.id); return; }   // reflect new comments on the post
    if (i == 2) { if (fsAddComment(m.id)) m.comments++; return; }
    return;
  }
}

// Smooth-scrolling message viewer (feed or comments) with momentum + footer.
// FEED footer: [< Prev][+ New Post][Next >] -> returns FSV_PREV / FSV_NEXT / FSV_BACK.
// COMMENTS footer: [Comment]                -> returns FSV_BACK.
static FSVResult fsViewer(FSMsg *arr, int n, const String &title, int mode, uint32_t ctxPost, int series) {
  const int SPR_H = SCRH - HDRH - NAVH;
  int top[FS_MAX], hh[FS_MAX], total;
  auto relayout = [&]() {
    total = FS_BM;
    for (int i = 0; i < n; i++) { hh[i] = fsBubbleH(arr[i], mode); top[i] = total; total += hh[i] + FS_BM; }
  };
  relayout();

  tft->fillScreen(COL_BG);
  drawHeader(title, true);

  TFT_eSprite spr(tft);
  spr.setColorDepth(16);
  if (spr.createSprite(SCRW, SPR_H) == nullptr) {     // needs PSRAM (~250 KB)
    statusLine("Not enough memory for this view.", TFT_RED);
    uint16_t a, b; waitTap(a, b);
    return FSV_BACK;
  }

