H4W9/ESP32_FlipSocial/ESP32_FlipSocial.ino
  auto footer = [&]() {
    if (mode == FS_FEED)          drawNav("< Prev", "New Post", "Next >");
    else if (mode == FS_COMMENTS) drawNav("", "Comment", "");
    else if (mode == FS_MESSAGES) drawNav("< Prev", "Send", "Next >");
    else                          drawNav("< Prev", "", "Next >");   // My Posts: page-only
  };

  float scroll = 0, fling = 0;
  bool wasDown = false, moved = false;
  uint16_t pX = 0, pY = 0, lastY = 0;
  float pScroll = 0, vel = 0;
  uint32_t lastT = 0;

  auto render = [&]() {
    float maxS = total > SPR_H ? total - SPR_H : 0;
    if (scroll < 0) scroll = 0;
    if (scroll > maxS) scroll = maxS;
    spr.fillSprite(COL_BG);
    for (int i = 0; i < n; i++) {
      int y = top[i] - (int)scroll;
      if (y + hh[i] < 0 || y > SPR_H) continue;
      fsDrawBubble(spr, arr[i], y, i, mode);
    }
    if (n == 0) {
      spr.setTextDatum(TL_DATUM);
      if (g_usingCache) {
        spr.setTextColor(TFT_RED, COL_BG);
        spr.drawString("Offline - no cached data yet.", 12, 10, 2);
        spr.setTextColor(COL_DIM, COL_BG);
        spr.drawString("Connect to WiFi to load.", 12, 30, 2);
      } else {
        spr.setTextColor(COL_DIM, COL_BG);
        spr.drawString(mode == FS_COMMENTS ? "No comments yet."
                     : mode == FS_MESSAGES ? "No messages yet." : "No posts.", 12, 10, 2);
      }
    }
    sprScrollBar(spr, SPR_H, total, scroll);
    spr.pushSprite(0, HDRH);
  };

  footer();
  render();

  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    uint16_t ty = touch->y(), tx = touch->x();
    uint32_t now = millis();
    bool need = false;

    if (down && !wasDown) {
      pX = tx; pY = ty; pScroll = scroll; moved = false; fling = 0; lastY = ty; lastT = now; vel = 0;
    } else if (down && wasDown) {
      int dy = (int)pY - (int)ty;
      if (abs(dy) > 6) moved = true;
      scroll = pScroll + dy;
      uint32_t dt = now - lastT;
      if (dt > 0) { vel = (float)((int)lastY - (int)ty) / (float)dt * 1000.0f; lastY = ty; lastT = now; }
      need = true;
    } else if (!down && wasDown) {
      if (!moved) {
        if (backTapped(pX, pY)) { spr.deleteSprite(); return FSV_BACK; }
        if ((int)pY >= SCRH - NAVH) {                     // footer nav bar
          int nh = navHit(pX, pY);
          if (mode == FS_FEED) {
            if (nh == 0) { spr.deleteSprite(); return FSV_PREV; }
            if (nh == 2) { spr.deleteSprite(); return FSV_NEXT; }
            if (nh == 1) { fsPost(); n = fsLoadFeed(arr, series); relayout(); scroll = 0;
                           tft->fillScreen(COL_BG); drawHeader(title, true); footer(); }
          } else if (mode == FS_COMMENTS) {
            if (nh == 1) { if (fsAddComment(ctxPost)) g_commentsAdded++;
                           n = fsLoadComments(arr, ctxPost); relayout(); scroll = 0;
                           tft->fillScreen(COL_BG); drawHeader(title, true); footer(); }
          } else if (mode == FS_MESSAGES) {
            if (nh == 0) { spr.deleteSprite(); return FSV_PREV; }   // previous conversation
            if (nh == 2) { spr.deleteSprite(); return FSV_NEXT; }   // next conversation
            if (nh == 1) {                                 // Send Message
              char b[FS_MAX_MESSAGE + 1] = {0};
              if (touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "Message:", false) && strlen(b))
                fsSendMessage(g_msgPeer, String(b));
              n = fsLoadMessages(arr, g_msgPeer); relayout(); scroll = 0;
              tft->fillScreen(COL_BG); drawHeader(title, true); footer();
            }
          } else if (mode == FS_MYPOSTS) {
            if (nh == 0) { spr.deleteSprite(); return FSV_PREV; }   // previous page
            if (nh == 2) { spr.deleteSprite(); return FSV_NEXT; }   // next page
          }
          need = true;
        } else if ((int)pY >= HDRH) {                      // tapped a bubble
          int fy = (int)pY - HDRH + (int)scroll;
          int idx = -1;
          for (int i = 0; i < n; i++) if (fy >= top[i] && fy < top[i] + hh[i]) { idx = i; break; }
          if (idx >= 0 && (mode == FS_FEED || mode == FS_MYPOSTS)) {   // open the post actions
            fsActionPopup(arr[idx]);
            tft->fillScreen(COL_BG); drawHeader(title, true); footer();
            need = true;
          } else if (idx >= 0 && mode == FS_COMMENTS) {   // tap a comment to flip/unflip it
            fsFlip(arr[idx]);
            need = true;
          }
        }
      } else {
        fling = vel;
      }
      need = true;
    } else if (fabs(fling) > 25) {
      scroll += fling * 0.016f;
      fling *= 0.95f;
      need = true;
    } else {
      fling = 0;
    }

    wasDown = down;
    if (need) render();
    delay(12);
  }
}

static int fsCommentsScreen(uint32_t postId) {
  static FSMsg cm[FS_MAX];
  g_commentsAdded = 0;
  tft->fillScreen(COL_BG); drawHeader("Comments", true);
  tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
  tft->drawString("Loading...", SCRW / 2, SCRH / 2, 2); tft->setTextDatum(TL_DATUM);
  int k = fsLoadComments(cm, postId);
  fsViewer(cm, k, g_usingCache ? "Comments [offline]" : "Comments", FS_COMMENTS, postId, 0);
  return g_commentsAdded;
}

static void feedScreen() {
  static FSMsg feed[FS_MAX];
  int series = 1;
  for (;;) {
    tft->fillScreen(COL_BG); drawHeader("Feed", true);
    tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
    tft->drawString("Loading feed...", SCRW / 2, SCRH / 2, 2); tft->setTextDatum(TL_DATUM);
    int n = fsLoadFeed(feed, series);
    String title = String("Feed  p") + series + (g_usingCache ? "  [offline]" : "");
    FSVResult r = fsViewer(feed, n, title, FS_FEED, 0, series);
    if (r == FSV_BACK) return;
    if (r == FSV_NEXT) series++;
    else if (r == FSV_PREV && series > 1) series--;
  }
}

// A single DM thread with `peer` — chat bubbles + [< Prev][+ Send][Next >] footer.
// Returns the viewer result so the caller can page between conversations.
static FSVResult messagesThreadScreen(const String &peer) {
  static FSMsg msgs[FS_MAX];
  g_msgPeer = peer;
  tft->fillScreen(COL_BG); drawHeader(String("@") + peer, true);
  tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
  tft->drawString("Loading...", SCRW / 2, SCRH / 2, 2); tft->setTextDatum(TL_DATUM);
  int n = fsLoadMessages(msgs, peer);
  return fsViewer(msgs, n, String("@") + peer + (g_usingCache ? "  [offline]" : ""), FS_MESSAGES, 0, 0);
}

// Messages — conversation list with a [Back][New Msg] footer. Tap a user to open
// the thread; Prev/Next in the thread page through the conversation list.
static void messagesScreen() {
  static String users[40];
  for (;;) {
    tft->fillScreen(COL_BG); drawHeader("Messages", true);
    tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
    tft->drawString("Loading...", SCRW / 2, SCRH / 2, 2); tft->setTextDatum(TL_DATUM);
    int n = fsLoadMsgUsers(users, 40);
    int sel = scrollList(g_usingCache ? "Messages [offline]" : "Messages", users, n, true, "Back", "New Msg", "");
    if (sel == SL_BACK || sel == SL_F0) return;
    if (sel == SL_F1) {                                // start a new conversation
      char b[64] = {0};
      if (touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "Message to (username):", false) && strlen(b)) {
        FSVResult rr;
        do { rr = messagesThreadScreen(String(b)); } while (rr != FSV_BACK);   // no list to page
      }
    } else if (sel >= 0 && sel < n) {                  // open a conversation; page with Prev/Next
      int cur = sel;
      for (;;) {
        FSVResult rr = messagesThreadScreen(users[cur]);
        if (rr == FSV_BACK) break;
        if (rr == FSV_NEXT) cur = (cur + 1) % n;
        else if (rr == FSV_PREV) cur = (cur + n - 1) % n;
      }
    }
  }
}

