H4W9/ESP32_FlipSocial/ESP32_FlipSocial.ino
// Guard: FlipSocial actions need WiFi + a username.
// Just a username set — enough to VIEW cached data offline.
static bool fsUserSet() {
  if (fsUser().length() == 0) {
    msgScreen("FlipSocial", "Set a username first", "Settings > Username", TFT_RED);
    return false;
  }
  return true;
}
// WiFi + username — required to POST (new post, comment, message, friend, search).
static bool fsReady() {
  if (WiFi.status() != WL_CONNECTED) {
    msgScreen("FlipSocial", "Connect WiFi first", "Settings > WiFi Setup", TFT_RED);
    return false;
  }
  return fsUserSet();
}

// Modal yes/no confirmation (theme + font colours). Returns true on OK.
static bool confirmDialog(const String &title, const String &sub) {
  // Cap the width to the panel — the 260 px design overflows the V8's 240 px.
  int bw = min(260, SCRW - 24), bh = 150, bx = (SCRW - bw) / 2, by = (SCRH - bh) / 2;
  tft->fillRoundRect(bx, by, bw, bh, 10, COL_ACCENT);
  tft->drawRoundRect(bx, by, bw, bh, 10, theme.neon(2, COL_SEL));
  tft->setTextColor(COL_FG, COL_ACCENT);
  tft->setTextDatum(MC_DATUM);
  tft->drawString(title, bx + bw / 2, by + 26, 2);
  tft->setTextColor(COL_DIM, COL_ACCENT);
  tft->drawString(sub, bx + bw / 2, by + 50, 2);
  int bhh = 36, byy = by + bh - bhh - 14, halfw = (bw - 48) / 2;
  int cx = bx + 16, okx = bx + bw / 2 + 8;
  tft->fillRoundRect(cx, byy, halfw, bhh, 6, COL_BG);
  tft->drawRoundRect(cx, byy, halfw, bhh, 6, COL_DIM);
  tft->setTextColor(COL_FG, COL_BG);
  tft->drawString("Cancel", cx + halfw / 2, byy + bhh / 2, 2);
  tft->fillRoundRect(okx, byy, halfw, bhh, 6, COL_SEL);
  tft->drawRoundRect(okx, byy, halfw, bhh, 6, COL_DIM);
  tft->setTextColor(COL_FG, COL_SEL);
  tft->drawString("OK", okx + halfw / 2, byy + bhh / 2, 2);
  tft->setTextDatum(TL_DATUM);
  for (;;) {
    uint16_t x, y;
    if (!waitTap(x, y)) continue;
    return inRect(x, y, okx, byy, halfw, bhh);   // OK button, else Cancel/dismiss
  }
}

// My Posts — the user's own posts, filtered client-side from the feed (no
// dedicated profile endpoint exists in the API). Read-only viewer.
static void myPostsScreen() {
  static FSMsg mine[FS_MAX], buf[FS_MAX];
  int series = 1;
  for (;;) {
    tft->fillScreen(COL_BG); drawHeader("My Posts", true);
    tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
    tft->drawString("Loading...", SCRW / 2, SCRH / 2, 2); tft->setTextDatum(TL_DATUM);
    String me = fsUser();
    int cnt = 0, n = fsLoadFeed(buf, series);
    for (int i = 0; i < n && cnt < FS_MAX; i++)
      if (buf[i].user == me) mine[cnt++] = buf[i];
    String title = String("My Posts  p") + series + (g_usingCache ? "  [offline]" : "");
    FSVResult r = fsViewer(mine, cnt, title, FS_MYPOSTS, 0, series);
    if (r == FSV_BACK) return;
    if (r == FSV_NEXT) series++;
    else if (r == FSV_PREV && series > 1) series--;
  }
}

// View Profile — bio, friends count, join date (GET /user/profile/{who}).
static void profileInfoScreen(const String &who) {
  tft->fillScreen(COL_BG); drawHeader("Profile", true);
  tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
  tft->drawString("Loading...", SCRW / 2, SCRH / 2, 2); tft->setTextDatum(TL_DATUM);
  FSProfile p = fsLoadProfile(who);

  // Only meaningful for your own profile, and only if we can actually reach the
  // API (a cached profile tells us nothing about whether the password works).
  bool self    = who.length() && who == fsUser();
  bool live    = (WiFi.status() == WL_CONNECTED) && !g_usingCache;
  bool checked = false;
  FSCred cred  = FSC_ERR;
  if (self && live) { cred = fsCheckCreds(); checked = true; }

  tft->fillRect(0, HDRH, SCRW, SCRH - HDRH, COL_BG);
  if (g_usingCache) drawHeader("Profile  [offline]", true);
  if (!p.ok) {
    // If the credential check knows why, say that instead of a generic failure.
    if (checked && cred != FSC_OK) statusLine(fsCredText(cred), TFT_RED);
    else statusLine(g_usingCache ? "Offline - no cached profile." : "Could not load profile.", TFT_RED);
    uint16_t x, y; waitTap(x, y); return;
  }

  int y = CONTENTY + 14;
  tft->setTextColor(COL_FG, COL_BG); tft->setTextDatum(TL_DATUM);
  tft->drawString(String("@") + who, 14, y, 4); y += 30;
  if (self) {
    uint16_t c = !checked ? COL_DIM : (cred == FSC_OK ? COL_OK : TFT_RED);
    tft->setTextColor(c, COL_BG);
    tft->drawString(checked ? fsCredText(cred) : "Credentials not checked (offline)", 14, y, 2);
    y += 24;
  } else y += 6;
  tft->setTextColor(COL_DIM, COL_BG);
  tft->drawString(String("Friends: ") + p.friends, 14, y, 2); y += 22;
  if (p.joined.length()) { tft->drawString(String("Joined: ") + p.joined, 14, y, 2); y += 26; }
  tft->setTextColor(COL_FG, COL_BG);
  tft->drawString("Bio", 14, y, 2); y += 22;
  String bio = p.bio.length() ? p.bio : String("(no bio yet)");
  String lines[18];
  int nl = fsWrap(bio, SCRW - 28, lines, 18);
  tft->setTextColor(p.bio.length() ? COL_FG : COL_DIM, COL_BG);
  for (int i = 0; i < nl && y < SCRH - 28; i++) { tft->drawString(lines[i], 14, y, 2); y += 20; }
  statusLine("Tap to go back.", COL_DIM);
  uint16_t x, ty; waitTap(x, ty);
}

// Friends — smooth-scroll list; tap a friend to remove (confirm).
static void friendsScreen() {
  static String fr[41];
  for (;;) {
    tft->fillScreen(COL_BG); drawHeader("Friends", true);
    tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
    tft->drawString("Loading...", SCRW / 2, SCRH / 2, 2); tft->setTextDatum(TL_DATUM);
    int n = fsLoadFriends(fr, 40);
    if (n == 0) {
      static String empty[1]; empty[0] = g_usingCache ? "Offline - no cached friends" : "(no friends yet)";
      if (scrollList(g_usingCache ? "Friends [offline]" : "Friends", empty, 1, false) < 0) return;
      continue;
    }
    int sel = scrollList("Friends", fr, n, true);
    if (sel < 0) return;
    if (sel >= 0 && sel < n && confirmDialog(String("Remove ") + fr[sel] + "?", "")) {
      if (!fsRemoveFriend(fr[sel])) msgScreen("Friends", "Remove failed", g_fsErr, TFT_RED);
    }
  }
}

// Profile — full account + social options (from the FlipSocial app).
static void profileScreen() {
  static const char *P[] = { "View Profile", "Edit Bio", "Friends", "Add Friend",
                             "My Posts", "Change Username", "Change Password", "Log Out" };
  static String rows[8];
  for (;;) {
    for (int i = 0; i < 8; i++) rows[i] = P[i];
    String u = fsUser();
    int sel = scrollList(u.length() ? (String("@") + u) : String("Profile"), rows, 8, true);
    if (sel < 0) return;
    switch (sel) {
      case 0: if (fsUserSet()) profileInfoScreen(fsUser()); break;   // View — offline ok
      case 1: if (fsReady()) {                                   // Edit Bio
                FSProfile p = fsLoadProfile(fsUser());
                char b[160] = {0}; strncpy(b, p.bio.c_str(), sizeof(b) - 1);
                if (touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "Edit Bio:", false)) {
                  bool ok = fsChangeBio(String(b));
                  msgScreen("Bio", ok ? "Bio updated" : "Update failed", ok ? String("") : g_fsErr,
                            ok ? COL_OK : TFT_RED);
                }
              } break;
      case 2: if (fsUserSet()) friendsScreen(); break;              // Friends — offline ok
      case 3: if (fsReady()) {                                   // Add Friend
                char b[64] = {0};
                if (touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "Add friend (username):", false)
                    && strlen(b)) {
                  bool ok = fsAddFriend(String(b));
                  msgScreen("Add Friend", ok ? "Request sent" : "Failed",
                            ok ? String(b) : g_fsErr, ok ? COL_OK : TFT_RED);
                }
              } break;
      case 4: if (fsUserSet()) myPostsScreen(); break;              // My Posts — offline ok
      case 5: { char b[64] = {0}; strncpy(b, u.c_str(), sizeof(b) - 1);
                if (touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "Username:", false))
                  credSet("user", String(b)); } break;
      case 6: { char b[64] = {0};
                if (touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "Password:", true))
                  credSet("pass", String(b)); } break;
      case 7: if (confirmDialog("Log out?", "Clears saved login")) {
                credSet("user", ""); credSet("pass", ""); return;
              } break;
    }
  }
}

// Actions for a user found via Explore: view profile, add friend, message.
static void exploreUserScreen(const String &who) {
  static String rows[3];
  for (;;) {
    rows[0] = "View Profile";
    rows[1] = "Add Friend";
    rows[2] = "Message";
    int sel = scrollList(String("@") + who, rows, 3, true);
    if (sel < 0) return;
    if (sel == 0) profileInfoScreen(who);
    else if (sel == 1) {
      bool ok = fsAddFriend(who);
      msgScreen("Add Friend", ok ? "Request sent" : "Failed", ok ? who : g_fsErr,
                ok ? COL_OK : TFT_RED);
    } else if (sel == 2) {
      FSVResult rr;
      do { rr = messagesThreadScreen(who); } while (rr != FSV_BACK);   // no list to page here
    }
  }
}

// Explore — search users by keyword, then act on a result.
static void exploreScreen() {
  static String users[40];
  char kw[64] = {0};
  if (!touchKeyboardInput(*tft, COL_FG, COL_BG, kw, sizeof(kw), "Search users:", false) || strlen(kw) == 0)
    return;
  for (;;) {
    tft->fillScreen(COL_BG); drawHeader("Explore", true);
    tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
    tft->drawString("Searching...", SCRW / 2, SCRH / 2, 2); tft->setTextDatum(TL_DATUM);
    int n = fsExplore(String(kw), users, 40);
    int sel = scrollList(String("Explore: ") + kw, users, n, true, "Back", "Search", "");
    if (sel == SL_BACK || sel == SL_F0) return;
    if (sel == SL_F1) {                                // new search
      kw[0] = 0;
      if (!touchKeyboardInput(*tft, COL_FG, COL_BG, kw, sizeof(kw), "Search users:", false) || strlen(kw) == 0)
        return;
      continue;
    }
    if (sel >= 0 && sel < n) exploreUserScreen(users[sel]);
  }
}

// Main menu (H4W9-style large rounded buttons)
static const char *MENU_ITEMS[] = { "Feed", "New Post", "Messages", "Explore", "Profile", "Settings" };
static const int    MENU_COUNT  = 6;
static const int    MENU_MARGIN = 16;
static const int    MENU_TOP    = CONTENTY + 12;
static const int    MENU_GAP    = 12;
static int menuBtnH() {
  int avail = SCRH - MENU_TOP - 12;
  return (avail - (MENU_COUNT - 1) * MENU_GAP) / MENU_COUNT;
}
static int menuBtnY(int i) { return MENU_TOP + i * (menuBtnH() + MENU_GAP); }
static int menuButtonAt(uint16_t x, uint16_t y) {
  if ((int)x < MENU_MARGIN || (int)x >= SCRW - MENU_MARGIN) return -1;
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int by = menuBtnY(i);
    if ((int)y >= by && (int)y < by + bh) return i;
  }
  return -1;
}

static void drawMenu() {
  tft->fillScreen(COL_BG);
  drawHeader("FlipSocial", false);
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int y = menuBtnY(i);
    tft->fillRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, COL_ACCENT);
    tft->drawRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, theme.neon(i * 3, COL_DIM));
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
    // V8's buttons are ~34 px tall — font 4 (26 px) crowds them, so use font 2.
#ifdef MARAUDER_V8
    tft->drawString(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 2);
#else
    tft->drawString(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 4);
#endif
  }
  tft->setTextDatum(TL_DATUM);
}

static void openMenuItem(int i) {
  switch (i) {
    case 0: if (fsUserSet()) feedScreen();     break;   // Feed — viewable offline (cache)
    case 1: if (fsReady())   fsPost();         break;   // New Post — needs WiFi
    case 2: if (fsUserSet()) messagesScreen(); break;   // Messages — viewable offline (cache)
    case 3: if (fsReady())   exploreScreen();  break;   // Explore — needs a live search
    case 4: profileScreen();               break;
    case 5: settingsFlow();                break;
    default: break;
  }
  drawMenu();
}

static bool mainMenuStart(ViewManager *viewManager) {
  drawMenu();
  return true;
}

